# 肩膀 + 增肌
shoulder_muscle = {
    1: [
        ('5009', '啞鈴前平舉', '肩膀'),
        ('5011', 'Cable機臉拉', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀'),
        ('5008', '啞鈴側平舉', '肩膀')
    ],
    2: [
        ('5012', '機械式肩推', '肩膀'),
        ('5008', '啞鈴側平舉', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀'),
        ('5011', 'Cable機臉拉', '肩膀')
    ],
    3: [
        ('5009', '啞鈴前平舉', '肩膀'),
        ('5008', '啞鈴側平舉', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀'),
        ('5011', 'Cable機臉拉', '肩膀')
    ],
    4: [
        ('5009', '啞鈴前平舉', '肩膀'),
        ('5013', '蝴蝶機反向飛鳥', '肩膀'),
        ('5012', '機械式肩推', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀')
    ],
    5: [
        ('5023', '槓鈴', '肩膀'),
        ('5008', '啞鈴側平舉', '肩膀'),
        ('5012', '機械式肩推', '肩膀'),
        ('5011', 'Cable機臉拉', '肩膀')
    ],
    6: [
        ('5008', '啞鈴側平舉', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀'),
        ('5013', '蝴蝶機反向飛鳥', '肩膀'),
        ('5023', '槓鈴', '肩膀')
    ],
    7: [
        ('5008', '啞鈴側平舉', '肩膀'),
        ('5011', 'Cable機臉拉', '肩膀'),
        ('5012', '機械式肩推', '肩膀'),
        ('5010', 'Cable肩部反向飛鳥', '肩膀')
    ]

}
# 胸肌 + 增肌
chest_muscle = {
    # Day 1
    1: [
        ('5001', '啞鈴', '胸肌'),
        ('5002', '槓鈴', '胸肌'),
        ('5003', '滑輪機', '胸肌'),
        ('5004', '史密斯機', '胸肌')
    ],
    # Day 2
    2: [
        ('5036', '槓鈴臥推', '胸肌'),
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5039', '飛鳥夾胸', '胸肌'),
        ('5040', '固定式機械胸推', '胸肌')
    ],
    # Day 3
    3: [
        ('5001', '啞鈴', '胸肌'),
        ('5036', '槓鈴臥推', '胸肌'),
        ('5003', '滑輪機', '胸肌'),
        ('5040', '固定式機械胸推', '胸肌')
    ],
    # Day 4
    4: [
        ('5002', '槓鈴', '胸肌'),
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5039', '飛鳥夾胸', '胸肌'),
        ('5004', '史密斯機', '胸肌')
    ],
    # Day 5
    5: [
        ('5001', '啞鈴', '胸肌'),
        ('5036', '槓鈴臥推', '胸肌'),
        ('5003', '滑輪機', '胸肌'),
        ('5039', '飛鳥夾胸', '胸肌')
    ],
    # Day 6
    6: [
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5004', '史密斯機', '胸肌'),
        ('5002', '槓鈴', '胸肌'),
        ('5040', '固定式機械胸推', '胸肌')
    ],
    # Day 7
    7: [
        ('5001', '啞鈴', '胸肌'),
        ('5003', '滑輪機', '胸肌'),
        ('5036', '槓鈴臥推', '胸肌'),
        ('5038', '啞鈴上斜臥推', '胸肌')
    ]
}
# 胸肌 + 減脂
chest_lose = {
    # Day 1
    1: [
        ('5002', '槓鈴', '胸肌'),
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5106', '溜冰式滑行', '有氧'),  # 3分鐘
        ('5104', '跑步機', '有氧')  # 15分鐘
    ],
    # Day 2
    2: [
        ('5001', '啞鈴', '胸肌'),
        ('5003', '滑輪機', '胸肌'),
        ('5108', '抬膝跳', '有氧'),  # 3分鐘
        ('5111', '棒式舉膝', '有氧')    # 3分鐘
    ],
    # Day 3
    3: [
        ('5001', '啞鈴', '胸肌'),
        ('5036', '槓鈴臥推', '胸肌'),
        ('5110', '反向弓箭步+抬膝', '有氧'),  # 3分鐘
        ('5112', '爬山式', '有氧')  # 3分鐘
    ],
    # Day 4
    4: [
        ('5001', '啞鈴', '胸肌'),
        ('5002', '槓鈴', '胸肌'),
        ('5101', '跳繩', '有氧'),  # 5分鐘
        ('5105', '側向抬膝', '有氧')    # 3分鐘
],
    # Day 5
    5: [
        ('5001', '啞鈴', '胸肌'),
        ('5036', '槓鈴臥推', '胸肌'),
        ('5104', '跑步機', '有氧'),     # 15分鐘
        ('5107', '打拳+快腳', '有氧')  # 3分鐘
    ],
    # Day 6
    6: [
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5004', '史密斯機', '胸肌'),
        ('5106', '溜冰式滑行', '有氧'),  # 3分鐘
        ('5109', '180度深蹲跳', '有氧')  # 3分鐘
    ],
    # Day 7
    7: [
        ('5036', '槓鈴臥推', '胸肌'),
        ('5038', '啞鈴上斜臥推', '胸肌'),
        ('5102', '飛輪', '有氧'),  # 15分鐘
        ('5103', '棒式', '有氧')  # 10分鐘
    ]
}
