# exercise_data.py
exercises_by_day = {
    1: [
        ('5035', '槓鈴深蹲', '腿部'),
        ('5020', '硬舉', '全身'),
        ('5036', '槓鈴臥推', '胸部'),
        ('5014', '闊背下拉', '背部')
    ],
    2: [
        ('5036', '槓鈴臥推', '胸部'),
        ('5037', '啞鈴側平舉', '肩部'),
        ('5014', '闊背下拉', '背部'),
        ('5012', '機械式肩推', '肩推')
    ],
    3: [
        ('5036', '槓鈴臥推', '胸部'),
        ('5038', '啞鈴上斜臥推', '胸部'),
        ('5012', '機械式肩推', '肩部'),
        ('5037', '啞鈴側平舉', '肩部')
    ],
    4: [
        ('5038', '啞鈴上斜臥推', '胸部'),
        ('5039', '飛鳥夾胸', '胸部'),
        ('5040', '固定式機械胸推', '胸部'),
        ('5041', '三頭滑輪下壓', '三頭肌')
    ],
    5: [
        ('5005', '啞鈴二頭彎舉', '二頭肌'),
        ('5041', '三頭滑輪下壓', '三頭肌'),
        ('5042', '過頭三頭屈伸', '三頭肌'),
        ('5006', '槓鈴彎舉', '二頭肌')
    ],
    6: [
        ('5036', '槓鈴臥推', '胸部'),
        ('5038', '啞鈴上斜臥推', '胸部'),
        ('5039', '飛鳥夾胸', '胸部'),
        ('5040', '固定式機械胸推', '胸部')
    ],
    7: [
        ('5036', '槓鈴臥推', '胸部'),
        ('5038', '啞鈴上斜臥推', '胸部'),
        ('5039', '飛鳥夾胸', '胸部'),
        ('5040', '固定式機械胸推', '胸部')
    ]
}
